
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hayas1/tfgh/actions/runs/11775888892)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:51]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_issue_label.update-files: Refreshing state... [id=tfgh:update-files]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"06de412a3b9e308ed13de1b0732dc7e4e7f928daa740cdb01fe2d152ca35d2ee\"" -> "W/\"eb03e0afbb58fc23bd79e1a48941a3afcfbdcac1b2a2356c4f74fd5cc6c45755\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced, as requested
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "f41f5344370746ca156db6ca908fdc5469d44377" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "11fa0dfcaa1db9362e1fd042f2b2494e696371ea" -> (known after apply)
      ~ id                    = "hayas1:tfgh:51" -> (known after apply)
      ~ labels                = [
          - "destroy",
          - "maintenance",
          - "manual",
        ] -> (known after apply)
      ~ number                = 51 -> (known after apply)
      ~ opened_at             = 1731250700 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731251080 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
module.repositories["tfgh"].github_repository_pull_request.managed: Destroying... [id=hayas1:tfgh:51]
module.repositories["tfgh"].github_repository_pull_request.managed: Destruction complete after 1s
module.repositories["tfgh"].github_repository_pull_request.managed: Creating...
module.repositories["tfgh"].github_repository_pull_request.managed: Creation complete after 3s [id=hayas1:tfgh:52]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":50,"Program":"tfcmt","SHA1":"f8013e9243ad862d620f20b314be3bf9cbced371","Vars":{},"WorkflowName":"Terraform apply on push"} -->